; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-1-6)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	)
(:init
	(at plane1 city4)
	(= (capacity plane1) 2768)
	(= (fuel plane1) 178)
	(= (slow-burn plane1) 1)
	(= (fast-burn plane1) 3)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 2)
	(at person1 city0)
	(at person2 city2)
	(at person3 city4)
	(at person4 city1)
	(at person5 city1)
	(at person6 city2)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 586)
	(= (distance city0 city2) 656)
	(= (distance city0 city3) 965)
	(= (distance city0 city4) 785)
	(= (distance city1 city0) 586)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 640)
	(= (distance city1 city3) 618)
	(= (distance city1 city4) 956)
	(= (distance city2 city0) 656)
	(= (distance city2 city1) 640)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 605)
	(= (distance city2 city4) 846)
	(= (distance city3 city0) 965)
	(= (distance city3 city1) 618)
	(= (distance city3 city2) 605)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 966)
	(= (distance city4 city0) 785)
	(= (distance city4 city1) 956)
	(= (distance city4 city2) 846)
	(= (distance city4 city3) 966)
	(= (distance city4 city4) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane1 city3)
	(at person1 city0)
	(at person2 city4)
	(at person3 city0)
	(at person4 city1)
	(at person5 city4)
	(at person6 city3)
	))

(:metric minimize (+ (* 4 (total-time))  (* 1 (total-fuel-used))))
)

; plan
1. (refuel plane1 city4)
   changed: (fuel plane1) from 178 to 2768
   goals met: 2 of 7
2. (board person3 plane1 city4)
   deleted: (at person3 city4)
   added: (in person3 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 2 of 7
3. (fly plane1 city4 city0)
   deleted: (at plane1 city4)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 0 to 785, (fuel plane1) from 2768 to 1983
   goals met: 2 of 7
4. (debark person3 plane1 city0)
   deleted: (in person3 plane1)
   added: (at person3 city0)
   changed: (onboard plane1) from 1 to 0
   goals met: 3 of 7
5. (fly plane1 city0 city2)
   deleted: (at plane1 city0)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 785 to 1441, (fuel plane1) from 1983 to 1327
   goals met: 3 of 7
6. (board person2 plane1 city2)
   deleted: (at person2 city2)
   added: (in person2 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 3 of 7
7. (board person6 plane1 city2)
   deleted: (at person6 city2)
   added: (in person6 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 3 of 7
8. (fly plane1 city2 city3)
   deleted: (at plane1 city2)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 1441 to 2046, (fuel plane1) from 1327 to 722
   goals met: 4 of 7
9. (refuel plane1 city3)
   changed: (fuel plane1) from 722 to 2768
   goals met: 4 of 7
10. (debark person6 plane1 city3)
   deleted: (in person6 plane1)
   added: (at person6 city3)
   changed: (onboard plane1) from 2 to 1
   goals met: 5 of 7
11. (fly plane1 city3 city1)
   deleted: (at plane1 city3)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 2046 to 2664, (fuel plane1) from 2768 to 2150
   goals met: 4 of 7
12. (board person5 plane1 city1)
   deleted: (at person5 city1)
   added: (in person5 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 4 of 7
13. (fly plane1 city1 city4)
   deleted: (at plane1 city1)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 2664 to 3620, (fuel plane1) from 2150 to 1194
   goals met: 4 of 7
14. (debark person2 plane1 city4)
   deleted: (in person2 plane1)
   added: (at person2 city4)
   changed: (onboard plane1) from 2 to 1
   goals met: 5 of 7
15. (debark person5 plane1 city4)
   deleted: (in person5 plane1)
   added: (at person5 city4)
   changed: (onboard plane1) from 1 to 0
   goals met: 6 of 7
16. (fly plane1 city4 city3)
   deleted: (at plane1 city4)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 3620 to 4586, (fuel plane1) from 1194 to 228
   goals met: 7 of 7
